HamEggsApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/BpelModule1/src/newWSDL">
  <soapenv:Body>
    <new:request>
      <eggs>3</eggs>
      <dishes>3</dishes>
      <airseconds>3</airseconds>
      <bakeseconds>3</bakeseconds>
    </new:request>
  </soapenv:Body>
</soapenv:Envelope>